plcexpert/plc-x-arduino-hardware/arm/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

###################   ATMEL ARM   ##################################
menu.module=Product
PLCARM.name= PLC-EXPERT (ARM)

## AT SAMD21G18
## -------------------------------------------------
PLCARM.menu.module.SAMD21G18=* AT SAMD21G18 (Native USB port)

PLCARM.menu.module.SAMD21G18.vid.0=0x2341
PLCARM.menu.module.SAMD21G18.pid.0=0x804d
PLCARM.menu.module.SAMD21G18.vid.1=0x2341
PLCARM.menu.module.SAMD21G18.pid.1=0x004d

PLCARM.menu.module.SAMD21G18.vid.2=0x2341
PLCARM.menu.module.SAMD21G18.pid.2=0x824d
# If the board is a 2341:824d use 2341:824d for build and set other parameters as well
PLCARM.menu.module.SAMD21G18.build.vid=0x2341
PLCARM.menu.module.SAMD21G18.build.pid=0x824d
PLCARM.menu.module.SAMD21G18.build.usb_product="Genuino Zero"
PLCARM.menu.module.SAMD21G18.bootloader.file=zero/samd21_sam_ba_genuino.bin

PLCARM.menu.module.SAMD21G18.vid.3=0x2341
PLCARM.menu.module.SAMD21G18.pid.3=0x024d
# If the board is a 2341:024d use 2341:824d for build and set other parameters as well
PLCARM.menu.module.SAMD21G18.build.vid=0x2341
PLCARM.menu.module.SAMD21G18.build.pid=0x824d
PLCARM.menu.module.SAMD21G18.build.usb_product="Genuino Zero"
PLCARM.menu.module.SAMD21G18.bootloader.file=zero/samd21_sam_ba_genuino.bin

PLCARM.menu.module.SAMD21G18.upload.tool=bossac
PLCARM.menu.module.SAMD21G18.upload.protocol=sam-ba
PLCARM.menu.module.SAMD21G18.upload.maximum_size=262144
PLCARM.menu.module.SAMD21G18.upload.use_1200bps_touch=true
PLCARM.menu.module.SAMD21G18.upload.wait_for_upload_port=true
PLCARM.menu.module.SAMD21G18.upload.native_usb=true
PLCARM.menu.module.SAMD21G18.build.mcu=cortex-m0plus
PLCARM.menu.module.SAMD21G18.build.f_cpu=48000000L
PLCARM.menu.module.SAMD21G18.build.usb_product="Arduino Zero"
PLCARM.menu.module.SAMD21G18.build.usb_manufacturer="Arduino LLC"
PLCARM.menu.module.SAMD21G18.build.board=SAMD_ZERO
PLCARM.menu.module.SAMD21G18.build.core=arduino
PLCARM.menu.module.SAMD21G18.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PLCARM.menu.module.SAMD21G18.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PLCARM.menu.module.SAMD21G18.build.openocdscript=openocd_scripts/arduino_zero.cfg
PLCARM.menu.module.SAMD21G18.build.variant=arduino_zero
PLCARM.menu.module.SAMD21G18.build.variant_system_lib=
PLCARM.menu.module.SAMD21G18.build.vid=0x2341
PLCARM.menu.module.SAMD21G18.build.pid=0x804d
PLCARM.menu.module.SAMD21G18.bootloader.tool=openocd
PLCARM.menu.module.SAMD21G18.bootloader.file=zero/samd21_sam_ba.bin

## MicroPLC
## -------------------------------------------------
PLCARM.menu.module.MICROPLC=PLC-Micro 1.4 (Native USB port)

PLCARM.menu.module.MICROPLC.vid.0=0x2341
PLCARM.menu.module.MICROPLC.pid.0=0x804d
PLCARM.menu.module.MICROPLC.vid.1=0x2341
PLCARM.menu.module.MICROPLC.pid.1=0x004d

PLCARM.menu.module.MICROPLC.vid.2=0x2341
PLCARM.menu.module.MICROPLC.pid.2=0x824d
# If the board is a 2341:824d use 2341:824d for build and set other parameters as well
PLCARM.menu.module.MICROPLC.build.vid=0x2341
PLCARM.menu.module.MICROPLC.build.pid=0x824d
PLCARM.menu.module.MICROPLC.build.usb_product="Genuino Zero"
PLCARM.menu.module.MICROPLC.bootloader.file=zero/samd21_sam_ba_genuino.bin

PLCARM.menu.module.MICROPLC.vid.3=0x2341
PLCARM.menu.module.MICROPLC.pid.3=0x024d
# If the board is a 2341:024d use 2341:824d for build and set other parameters as well
PLCARM.menu.module.MICROPLC.build.vid=0x2341
PLCARM.menu.module.MICROPLC.build.pid=0x824d
PLCARM.menu.module.MICROPLC.build.usb_product="Genuino Zero"
PLCARM.menu.module.MICROPLC.bootloader.file=zero/samd21_sam_ba_genuino.bin

PLCARM.menu.module.MICROPLC.upload.tool=bossac
PLCARM.menu.module.MICROPLC.upload.protocol=sam-ba
PLCARM.menu.module.MICROPLC.upload.maximum_size=262144
PLCARM.menu.module.MICROPLC.upload.use_1200bps_touch=true
PLCARM.menu.module.MICROPLC.upload.wait_for_upload_port=true
PLCARM.menu.module.MICROPLC.upload.native_usb=true
PLCARM.menu.module.MICROPLC.build.mcu=cortex-m0plus
PLCARM.menu.module.MICROPLC.build.f_cpu=48000000L
PLCARM.menu.module.MICROPLC.build.usb_product="Arduino Zero"
PLCARM.menu.module.MICROPLC.build.usb_manufacturer="Arduino LLC"
PLCARM.menu.module.MICROPLC.build.board=SAMD_ZERO
PLCARM.menu.module.MICROPLC.build.core=arduino
PLCARM.menu.module.MICROPLC.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PLCARM.menu.module.MICROPLC.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PLCARM.menu.module.MICROPLC.build.openocdscript=openocd_scripts/arduino_zero.cfg
PLCARM.menu.module.MICROPLC.build.variant=arduino_zero
PLCARM.menu.module.MICROPLC.build.variant_system_lib=
PLCARM.menu.module.MICROPLC.build.vid=0x2341
PLCARM.menu.module.MICROPLC.build.pid=0x804d
PLCARM.menu.module.MICROPLC.bootloader.tool=openocd
PLCARM.menu.module.MICROPLC.bootloader.file=zero/samd21_sam_ba.bin
